MoseychukA/FLARM_ALL/Base_Lan_ESP32/ChatGPT_FlyRF_LanNew/FlyRf_LanUdp_26_03_31_08/WebRF.cpp
static String rootPage()
{
    String html = htmlBegin("FlyRf LAN");
    html += F("<h1>FlyRf Lan</h1><table>");
    html += F("<tr><th>&#1048;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</th><td>");
    html += DeviceInfo_chipIdHex();
    html += F("</td></tr>");
    html += F("<tr><th>&#1041;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1072;&#1076;&#1088;&#1077;&#1089;</th><td>");
    char addrBuf[16];
    snprintf(addrBuf, sizeof(addrBuf), "%06lX", (unsigned long)(settings ? settings->block_addr : 0));
    html += addrBuf;
    html += F("</td></tr>");
    html += F("<tr><th>&#1042;&#1077;&#1088;&#1089;&#1080;&#1103; &#1055;&#1054;</th><td>");
    html += DeviceInfo_programVersion();
    html += F("</td></tr>");
    html += F("<tr><th>Radio</th><td>SX127x</td></tr>");
    uint32_t txPackets = 0;
    uint32_t rxPackets = 0;
    RF_GetPacketCounters(txPackets, rxPackets);
    uint32_t lanTxPackets = 0;
    uint32_t lanRxPackets = 0;
    uint32_t lanUdpTxPackets = 0;
    uint32_t lanUdpRxPackets = 0;
    uint32_t lanTcpTxPackets = 0;
    uint32_t lanTcpRxPackets = 0;
    LAN_getPacketCounters(lanTxPackets, lanRxPackets, lanUdpTxPackets, lanUdpRxPackets, lanTcpTxPackets, lanTcpRxPackets);
    html += F("<tr><th>LoRa &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;</th><td id='pktCounters'>Tx&nbsp; ");
    html += String(txPackets);
    html += F("&nbsp;&nbsp;&nbsp; Rx&nbsp; ");
    html += String(rxPackets);
    html += F("</td></tr>");
    html += F("<tr><th>&#1051;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; latitude</th><td>");
    html += String(settings ? settings->local_latitude : 55.95501f, 5);
    html += F("</td></tr>");
    html += F("<tr><th>&#1051;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; longitude</th><td>");
    html += String(settings ? settings->local_longitude : 37.23166f, 5);
    html += F("</td></tr>");
    html += F("<tr><th>Local IP(UDP)</th><td>");
    html += ipToString(settings ? settings->g_localIP : nullptr);
    html += F("</td></tr>");
    html += F("<tr><th>Gateway(UDP)</th><td>");
    html += ipToString(settings ? settings->g_gatewayIP : nullptr);
    html += F("</td></tr>");
    html += F("<tr><th>Subnet mask(UDP)</th><td>");
    html += ipToString(settings ? settings->g_subnetMask : nullptr);
    html += F("</td></tr>");
    html += F("<tr><th>DNS Server(UDP)</th><td>");
    html += ipToString(settings ? settings->g_dns_server : nullptr);
    html += F("</td></tr>");
    html += F("<tr><th>MAC &#1072;&#1076;&#1088;&#1077;&#1089; LAN</th><td id='macAddr'>");
    html += LAN_macAddressStr();
    html += F("</td></tr>");
    html += F("<tr><th>LAN/UDP &#1072;&#1076;&#1088;&#1077;&#1089;</th><td id='tcpAddr'>");
    html += LAN_tcpAddressStr();
    html += F("</td></tr>");
    html += F("<tr><th>&#1057;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; LAN</th><td id='lanLinkState'>");
    html += LAN_linkStatusStr();
    html += LAN_dhcpLeaseActive() ? F(" / DHCP") : F(" / Static");
    html += F("</td></tr>");
    html += F("<tr><th>&#1055;&#1072;&#1082;&#1077;&#1090;&#1099; LAN</th><td id='lanPktCounters'>Tx&nbsp; ");
    html += String(lanTxPackets);
    html += F("&nbsp;&nbsp;&nbsp; Rx&nbsp; ");
    html += String(lanRxPackets);
    html += F("</td></tr>");
    html += F("</table><div class='hr'></div>");
    html += F("<div class='btnRow' style='flex-direction:column;align-items:center;'>");
    html += F("<a class='btn frontBtn' data-startbtn='1' href='/settings'><span class='btnIcon'>&#9881;</span>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</a>");
    html += F("<a class='btn frontBtn' data-startbtn='1' href='/hardware_settings'><span class='btnIcon'>&#129520;</span>&#1040;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</a>");
    html += F("<a class='btn frontBtn' data-startbtn='1' href='/outputs'><span class='btnIcon'>&#128228;</span>&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1086;&#1084;</a>");
    html += F("<a class='btn frontBtn' data-startbtn='1' href='/about'><span class='btnIcon'>&#8505;</span>&#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;</a>");
    html += F("<a class='btn frontBtn' data-startbtn='1' href='/firmware'><span class='btnIcon'>&#11014;</span>&#1054;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;</a>");
    html += F("</div>");
    html += F(R"JS(<script>
(function(){
  var el=document.getElementById('pktCounters');
  var macEl=document.getElementById('macAddr');
  var tcpEl=document.getElementById('tcpAddr');
  var lanEl=document.getElementById('lanPktCounters');
  var linkEl=document.getElementById('lanLinkState');
  if(!el) return;
  var busy=false;
  function applyActiveButtons(){
    var items=document.querySelectorAll('[data-startbtn="1"]');
    if(!items || !items.length) return;
    var active='';
    try{ active=localStorage.getItem('flyrf_start_active') || ''; }catch(e){}
    for(var i=0;i<items.length;i++){
      var href=items[i].getAttribute('href') || '';
      if(active && href===active) items[i].classList.add('active');
      else items[i].classList.remove('active');
      items[i].addEventListener('click', function(){
        try{ localStorage.setItem('flyrf_start_active', this.getAttribute('href') || ''); }catch(e){}
      });
    }
  }
  applyActiveButtons();

  function updateCounters(){
    if(busy) return;
    busy=true;
    fetch('/packet_counters',{cache:'no-store'})
      .then(function(r){ return r.ok ? r.json() : Promise.reject(); })
      .then(function(data){
        if(!data) return;
        el.innerHTML='Tx&nbsp; '+(data.tx||0)+'&nbsp;&nbsp;&nbsp; Rx&nbsp; '+(data.rx||0);
        if(macEl && data.mac) macEl.textContent=data.mac;
        if(tcpEl && data.tcp_addr) tcpEl.textContent=data.tcp_addr;
        if(linkEl) linkEl.textContent=(data.lan_link_text||'LAN Off')+' / '+((data.lan_dhcp||false)?'DHCP':'Static');
        if(lanEl) lanEl.innerHTML='Tx&nbsp; '+(data.lan_tx||0)+'&nbsp;&nbsp;&nbsp; Rx&nbsp; '+(data.lan_rx||0);
      })
      .catch(function(){} )
      .finally(function(){ busy=false; });
  }
  updateCounters();
  setInterval(updateCounters,1000);
})();
</script>)JS");
    html += F("</div></body></html>");
    return html;
}

static String settingsPage()
{
    String html = htmlBegin("&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;");
    html += F("<h1>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</h1><form id='settings_form' action='/input' method='GET'>");
    html += F("<div class='settingsBlock'><div class='blockTitle'>&#1054;&#1073;&#1097;&#1080;&#1077; &#1088;&#1077;&#1078;&#1080;&#1084;&#1099;</div><table>");
    html += F("<tr><th>TRACKER send</th><td><select class='wShort settingsTopCtl50' name='tracker_send'>");
    html += String("<option ") + sel(settings && settings->tracker_send == 0) + " value='0'>Off</option>";
    html += String("<option ") + sel(settings && settings->tracker_send == 1) + " value='1'>Single</option>";
    html += String("<option ") + sel(settings && settings->tracker_send == 2) + " value='2'>Auto</option>";
    html += String("<option ") + sel(settings && settings->tracker_send == 3) + " value='3'>Mini</option>";
    html += F("</select></td></tr>");    html += F("<tr><th>NMEA output</th><td><select class='wMed settingsTopCtl50' name='nmea_out'>");
    html += String("<option ") + sel(settings && settings->nmea_out == 0) + " value='0'>Off</option>";
    html += String("<option ") + sel(settings && settings->nmea_out == NMEA_OUT_UDP) + " value='1'>UDP</option>";
    html += F("</select></td></tr>");
    html += F("</table></div>");
    html += F("<div class='settingsBlock'><div class='blockTitle'>&#1051;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099;</div><table>");
    html += F("<tr><th>&#1055;&#1086;&#1083;&#1091;&#1096;&#1072;&#1088;&#1080;&#1077; (&#1089;&#1077;&#1074;&#1077;&#1088;/&#1102;&#1075;)</th><td><select class='wShort settingsTopCtl50' name='input_N_S'>");
    html += String("<option ") + sel(settings && settings->input_N_S == 0) + " value='0'>N</option>";
    html += String("<option ") + sel(settings && settings->input_N_S != 0) + " value='1'>S</option>";
    html += F("</select></td></tr>");
    html += F("<tr><th>latitude (&#1096;&#1080;&#1088;&#1086;&#1090;&#1072; 0&#176; - 90&#176;)</th><td><input class='settingsTopCtl50' type='text' name='local_latitude' value='");
    html += String(settings ? settings->local_latitude : 55.95501f, 5);
    html += F("'></td></tr>");
    html += F("<tr><th>&#1044;&#1086;&#1083;&#1075;&#1086;&#1090;&#1072; (&#1074;&#1086;&#1089;&#1090;&#1086;&#1082;/&#1079;&#1072;&#1087;&#1072;&#1076;)</th><td><select class='wShort settingsTopCtl50' name='input_E_W'>");
    html += String("<option ") + sel(settings && settings->input_E_W == 0) + " value='0'>E</option>";
    html += String("<option ") + sel(settings && settings->input_E_W != 0) + " value='1'>W</option>";
    html += F("</select></td></tr>");
    html += F("<tr><th>longitude (0&#176; - 180&#176;)</th><td><input class='settingsTopCtl30' type='text' name='local_longitude' value='");
    html += String(settings ? settings->local_longitude : 37.23166f, 5);
    html += F("'></td></tr>");
    html += F("</table></div>");
    html += F("<div class='settingsBlock'><div class='blockTitle'>UDP / LAN</div><table>");
    html += F("<tr><th>Local IP(UDP) address</th><td><input class='settingsTopCtl30' type='text' name='local_ip' value='");
    html += ipToString(settings ? settings->g_localIP : nullptr);
    html += F("'></td></tr>");
    html += F("<tr><th>Gateway IP(UDP) address</th><td><input class='settingsTopCtl30' type='text' name='gateway_ip' value='");
    html += ipToString(settings ? settings->g_gatewayIP : nullptr);
    html += F("'></td></tr>");
    html += F("<tr><th>Subnet mask(UDP)</th><td><input class='settingsTopCtl30' type='text' name='subnet_mask' value='");
    html += ipToString(settings ? settings->g_subnetMask : nullptr);
    html += F("'></td></tr>");
    html += F("<tr><th>DNS Server(UDP)</th><td><input class='settingsTopCtl30' type='text' name='dns_server' value='");
    html += ipToString(settings ? settings->g_dns_server : nullptr);
    html += F("'></td></tr>");
    html += F("</table></div><div class='btnRowEqual'><button class='btn' type='submit'><span class='btnIcon'>&#128190;</span>&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1080; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;</button><a class='btn' href='/'><span class='btnIcon'>&#8634;</span>&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090; &#1073;&#1077;&#1079; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103;</a></div></form>");
    html += F("</div></body></html>");

    return html;
}

static String settingsSavedPage()
{
    String html = htmlBegin("&#1053;&#1086;&#1074;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;");
    html += F("<h1>&#1053;&#1086;&#1074;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;:</h1><table>");
    html += F("<tr><th>TRACKER send</th><td>"); html += trackerSendName(settings ? settings->tracker_send : 0); html += F("</td></tr>");
    html += F("<tr><th>NMEA Out</th><td>"); html += nmeaName(settings ? settings->nmea_out : 0); html += F("</td></tr>");
    html += F("<tr><th>&#1055;&#1086;&#1083;&#1091;&#1096;&#1072;&#1088;&#1080;&#1077;</th><td>"); html += (settings && settings->input_N_S ? "S" : "N"); html += F("</td></tr>");
    html += F("<tr><th>Latitude</th><td>"); html += String(settings ? settings->local_latitude : 55.95501f, 5); html += F("</td></tr>");
    html += F("<tr><th>&#1044;&#1086;&#1083;&#1075;&#1086;&#1090;&#1072;</th><td>"); html += (settings && settings->input_E_W ? "W" : "E"); html += F(" "); html += String(settings ? settings->local_longitude : 37.23166f, 5); html += F("</td></tr>");
    html += F("<tr><th>Local IP(UDP)</th><td>"); html += ipToString(settings ? settings->g_localIP : nullptr); html += F("</td></tr>");
    html += F("<tr><th>Gateway IP(UDP)</th><td>"); html += ipToString(settings ? settings->g_gatewayIP : nullptr); html += F("</td></tr>");
    html += F("<tr><th>Subnet Mask(UDP)</th><td>"); html += ipToString(settings ? settings->g_subnetMask : nullptr); html += F("</td></tr>");
    html += F("<tr><th>DNS Server(UDP)</th><td>"); html += ipToString(settings ? settings->g_dns_server : nullptr); html += F("</td></tr>");
    html += F("<tr><th>&#1040;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; AP IP</th><td>"); html += WiFi_apIP().toString(); html += F("</td></tr>");
    html += F("</table><div class='hr'></div><div class='confirmTitle'>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1099; &#1073;&#1077;&#1079; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080;.</div><div class='btnRow'><a class='btn' href='/'><span class='btnIcon'>&#127968;</span>&#1053;&#1072; &#1075;&#1083;&#1072;&#1074;&#1085;&#1091;&#1102;</a></div></div></body></html>");
    return html;
}

