MoseychukA/FLARM_ALL/Base_Lan_ESP32/ChatGPT_FlyRF_LanNew/FlyRf_LanUdp_26_03_31_08/WebRF.cpp
static String hardwarePage()
{
    String html = htmlBegin("&#1040;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;");
    html += F("<h1>&#1040;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</h1><form id='hardware_form' action='/hardware_input' method='GET'>");
    html += F("<div class='settingsBlock'><div class='blockTitle'>&#1044;&#1080;&#1089;&#1087;&#1083;&#1077;&#1081; &#1080; LAN</div><table>");
    html += F("<tr><th>&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; LoRa</th><td><select class='wMed hardwareCtl50' name='rssi_view'>");
    html += String("<option ") + sel(settings && settings->rssi_view == 0) + " value='0'>&#1042;&#1099;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;</option>";
    html += String("<option ") + sel(settings && settings->rssi_view != 0) + " value='1'>&#1042;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;</option>";
    html += F("</select></td></tr>");
    html += F("<tr><th>&#1042;&#1099;&#1074;&#1086;&#1076; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072; &#1076;&#1080;&#1089;&#1087;&#1083;&#1077;&#1081;</th><td><select class='wLong hardwareCtl30' name='display_set'>");
    html += String("<option ") + sel((settings ? settings->display_set : INFO_DISTLAY_OFF) == INFO_DISTLAY_OFF) + " value='0'>&#1053;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;</option>";
    html += String("<option ") + sel((settings ? settings->display_set : INFO_DISPLAY_COORDINATE) == INFO_DISPLAY_COORDINATE) + " value='1'>&#1057; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;&#1080;</option>";
    html += String("<option ") + sel((settings ? settings->display_set : INFO_DISPLAY_MAXI) == INFO_DISPLAY_MAXI) + " value='2'>&#1055;&#1086;&#1083;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;</option>";
    html += F("</select></td></tr>");
    html += F("<tr><th>&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; LAN</th><td><select class='wMed hardwareCtl50' name='lan_state_view'>");
    html += String("<option ") + sel(!(settings && settings->lan_state_view)) + " value='0'>&#1042;&#1099;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;</option>";
    html += String("<option ") + sel(settings && settings->lan_state_view) + " value='1'>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;</option>";
    html += F("</select></td></tr>");
    html += F("<tr><th>&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1090;&#1077;&#1089;&#1090;&#1086;&#1074;&#1099;&#1093; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;</th><td><select class='wMed hardwareCtl50' name='view_test_coord'>");
    html += String("<option ") + sel(!(settings && settings->view_test_coord)) + " value='0'>&#1042;&#1099;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;</option>";
    html += String("<option ") + sel(settings && settings->view_test_coord) + " value='1'>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;</option>";
    html += F("</select></td></tr>");
    html += F("</table></div>");
    html += F("<div class='settingsBlock'><div class='blockTitle'>&#1042;&#1099;&#1074;&#1086;&#1076; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</div><table>");
    html += F("<tr><th>&#1042;&#1099;&#1074;&#1086;&#1076; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; Serial</th><td><select class='wLong hardwareCtl50' name='serial_out'>");
    html += String("<option ") + sel((settings ? settings->serial_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_OFF) + " value='0'>&#1053;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;</option>";
    html += String("<option ") + sel((settings ? settings->serial_out : OUTPUT_MODE_CONTAINER) == OUTPUT_MODE_CONTAINER) + " value='1'>Container</option>";
    html += String("<option ") + sel((settings ? settings->serial_out : OUTPUT_MODE_NMEA) == OUTPUT_MODE_NMEA) + " value='2'>NMEA</option>";
    html += String("<option ") + sel((settings ? settings->serial_out : OUTPUT_MODE_RP2040) == OUTPUT_MODE_RP2040) + " value='3'>RP2040 RX</option>";
    html += String("<option ") + sel((settings ? settings->serial_out : OUTPUT_MODE_FLARM) == OUTPUT_MODE_FLARM) + " value='4'>FLARM RX</option>";
    html += F("</select></td></tr>");
    html += F("<tr><th>&#1042;&#1099;&#1074;&#1086;&#1076; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; RS485</th><td><select class='wLong hardwareCtl50' name='rs485_out'>");
    html += String("<option ") + sel((settings ? settings->rs485_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_OFF) + " value='0'>&#1053;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;</option>";
    html += String("<option ") + sel((settings ? settings->rs485_out : OUTPUT_MODE_CONTAINER) == OUTPUT_MODE_CONTAINER) + " value='1'>Container</option>";
    html += String("<option ") + sel((settings ? settings->rs485_out : OUTPUT_MODE_NMEA) == OUTPUT_MODE_NMEA) + " value='2'>NMEA</option>";
    html += String("<option ") + sel((settings ? settings->rs485_out : OUTPUT_MODE_RS485_DISPLAY) == OUTPUT_MODE_RS485_DISPLAY) + " value='3'>&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1076;&#1080;&#1089;&#1087;&#1083;&#1077;&#1081;</option>";
    html += String("<option ") + sel((settings ? settings->rs485_out : OUTPUT_MODE_FLARM) == OUTPUT_MODE_FLARM) + " value='4'>FLARM RX</option>";
    html += F("</select></td></tr>");
    html += F("</table></div>");
    html += F("<div class='settingsBlock'><div class='blockTitle'>&#1057;&#1083;&#1091;&#1078;&#1077;&#1073;&#1085;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;</div><table>");
    html += F("<tr><th>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</th><td><select class='wMed hardwareCtl30' name='default_settings'>");
    html += F("<option value='0' selected>&#1053;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100;</option>");
    html += F("<option value='1'>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;</option>");
    html += F("</select></td></tr>");
    char blockAddr[16];
    snprintf(blockAddr, sizeof(blockAddr), "%06lX", (unsigned long)(settings ? settings->block_addr : 0));
    html += F("<tr><th>Block addr</th><td><input class='hardwareCtl60' type='text' name='block_addr' value='");
    html += blockAddr;
    html += F("'></td></tr>");
    html += F("<tr><th>&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1087;&#1086;&#1088;&#1086;&#1075;&#1072; &#1091;&#1089;&#1080;&#1083;&#1080;&#1090;&#1077;&#1083;&#1103; 1090&#1084;&#1043;&#1094; (mV)</th><td><input class='hardwareCtl60' type='number' name='threshold_level' min='0' max='4095' value='");
    html += String(settings ? settings->threshold_level : 910);
    html += F("'></td></tr>");
    html += F("</table></div><div class='btnRowEqual'><button class='btn' type='submit'><span class='btnIcon'>&#128190;</span>&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1080; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;</button><a class='btn' href='/'><span class='btnIcon'>&#8634;</span>&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090; &#1073;&#1077;&#1079; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103;</a></div></form>");
    html += F("</div></body></html>");

    return html;
}

static String hardwareSavedPage(bool defaultsLoaded)
{
    String html = htmlBegin("&#1053;&#1086;&#1074;&#1099;&#1077; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;");
    html += F("<h1>&#1053;&#1086;&#1074;&#1099;&#1077; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;:</h1><table>");
    html += F("<tr><th>&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; LoRa</th><td>"); html += yesNo(settings ? settings->rssi_view : 0, "&#1042;&#1099;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;", "&#1042;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;"); html += F("</td></tr>");
    html += F("<tr><th>&#1056;&#1077;&#1078;&#1080;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1076;&#1080;&#1089;&#1087;&#1083;&#1077;&#1103;</th><td>"); html += displayModeName(settings ? settings->display_set : INFO_DISTLAY_OFF); html += F("</td></tr>");
    html += F("<tr><th>&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; LAN</th><td>"); html += yesNo(settings ? settings->lan_state_view : 0, "&#1042;&#1099;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;", "&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;"); html += F("</td></tr>");
    html += F("<tr><th>&#1042;&#1099;&#1074;&#1086;&#1076; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; Serial</th><td>"); html += serialModeName(settings ? settings->serial_out : OUTPUT_MODE_OFF); html += F("</td></tr>");
    html += F("<tr><th>&#1042;&#1099;&#1074;&#1086;&#1076; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; RS485</th><td>"); html += rs485ModeName(settings ? settings->rs485_out : OUTPUT_MODE_OFF); html += F("</td></tr>");
    html += F("<tr><th>&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;</th><td>"); html += yesNo(settings ? settings->view_test_coord : 0, "&#1042;&#1099;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;", "&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;"); html += F("</td></tr>");
    html += F("<tr><th>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</th><td>"); html += (defaultsLoaded ? "&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086;" : "&#1053;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100;"); html += F("</td></tr>");
    char blockAddr[16]; snprintf(blockAddr, sizeof(blockAddr), "%06lX", (unsigned long)(settings ? settings->block_addr : 0));
    html += F("<tr><th>Block addr</th><td>"); html += blockAddr; html += F("</td></tr>");
    html += F("<tr><th>&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1087;&#1086;&#1088;&#1086;&#1075;&#1072; &#1091;&#1089;&#1080;&#1083;&#1080;&#1090;&#1077;&#1083;&#1103; 1090&#1084;&#1043;&#1094; (mV)</th><td>"); html += String(settings ? settings->threshold_level : 910); html += F("</td></tr>");
    html += F("<tr><th>Local IP(UDP)</th><td>"); html += ipToString(settings ? settings->g_localIP : nullptr); html += F("</td></tr>");
    html += F("<tr><th>Gateway IP(UDP)</th><td>"); html += ipToString(settings ? settings->g_gatewayIP : nullptr); html += F("</td></tr>");
    html += F("<tr><th>Subnet mask(UDP)</th><td>"); html += ipToString(settings ? settings->g_subnetMask : nullptr); html += F("</td></tr>");
    html += F("<tr><th>DNS Server(UDP)</th><td>"); html += ipToString(settings ? settings->g_dns_server : nullptr); html += F("</td></tr>");
    html += F("<tr><th>&#1040;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; AP IP</th><td>"); html += WiFi_apIP().toString(); html += F("</td></tr>");
    html += F("</table><div class='hr'></div><div class='confirmTitle'>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1099; &#1073;&#1077;&#1079; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080;.</div><div class='btnRow'><a class='btn' href='/'><span class='btnIcon'>&#127968;</span>&#1053;&#1072; &#1075;&#1083;&#1072;&#1074;&#1085;&#1091;&#1102;</a></div></div></body></html>");
    return html;
}

static String outputsPage()
{
    String html = htmlBegin("&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1086;&#1084;");
    html += F("<h1>&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1086;&#1084;</h1><form id='outputs_form' action='/outputs_save' method='GET'><table>");
    html += F("<tr><th>LAN NMEA UDP</th><td><select class='wShort' name='udp_on'>");
    html += String("<option ") + sel(!(settings && (settings->nmea_out & NMEA_OUT_UDP))) + " value='0'>Off</option>";
    html += String("<option ") + sel(settings && (settings->nmea_out & NMEA_OUT_UDP)) + " value='1'>On</option>";
    html += F("</select></td></tr>");    html += F("<tr><th>&#1042;&#1099;&#1074;&#1086;&#1076; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; Serial</th><td><select class='wMed hardwareCtl50' name='serial_out'>");
    html += String("<option ") + sel((settings ? settings->serial_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_OFF) + " value='0'>&#1053;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;</option>";
    html += String("<option ") + sel((settings ? settings->serial_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_CONTAINER) + " value='1'>Container</option>";
    html += String("<option ") + sel((settings ? settings->serial_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_NMEA) + " value='2'>NMEA</option>";
    html += String("<option ") + sel((settings ? settings->serial_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_RP2040) + " value='3'>RP2040 RX</option>";
    html += String("<option ") + sel((settings ? settings->serial_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_FLARM) + " value='4'>FLARM RX</option>";
    html += F("</select></td></tr>");
    html += F("<tr><th>&#1042;&#1099;&#1074;&#1086;&#1076; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; RS485</th><td><select class='wMed hardwareCtl30' name='rs485_out'>");
    html += String("<option ") + sel((settings ? settings->rs485_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_OFF) + " value='0'>&#1053;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;</option>";
    html += String("<option ") + sel((settings ? settings->rs485_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_CONTAINER) + " value='1'>Container</option>";
    html += String("<option ") + sel((settings ? settings->rs485_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_NMEA) + " value='2'>NMEA</option>";
    html += String("<option ") + sel((settings ? settings->rs485_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_RS485_DISPLAY) + " value='3'>&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1076;&#1080;&#1089;&#1087;&#1083;&#1077;&#1081;</option>";
    html += String("<option ") + sel((settings ? settings->rs485_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_FLARM) + " value='4'>FLARM RX</option>";
    html += F("</select></td></tr></table><div class='btnRowEqual'><button class='btn' type='submit'><span class='btnIcon'>&#128190;</span>&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1080; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;</button><a class='btn' href='/'><span class='btnIcon'>&#8634;</span>&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090; &#1073;&#1077;&#1079; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103;</a></div></form>");
    html += F("</div></body></html>");

    return html;
}

static String outputsSavedPage()
{
    String html = htmlBegin("&#1053;&#1086;&#1074;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072;");
    html += F("<h1>&#1053;&#1086;&#1074;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072;:</h1><table>");
    html += F("<tr><th>LAN NMEA UDP</th><td>"); html += ((settings && (settings->nmea_out & NMEA_OUT_UDP)) ? "On" : "Off"); html += F("</td></tr>");
    html += F("<tr><th>&#1042;&#1099;&#1074;&#1086;&#1076; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; Serial</th><td>"); html += serialModeName(settings ? settings->serial_out : OUTPUT_MODE_OFF); html += F("</td></tr>");
    html += F("<tr><th>&#1042;&#1099;&#1074;&#1086;&#1076; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; RS485</th><td>"); html += rs485ModeName(settings ? settings->rs485_out : OUTPUT_MODE_OFF); html += F("</td></tr>");
    html += F("</table><div class='hr'></div><div class='confirmTitle'>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1099; &#1073;&#1077;&#1079; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080;.</div><div class='btnRow'><a class='btn' href='/'><span class='btnIcon'>&#127968;</span>&#1053;&#1072; &#1075;&#1083;&#1072;&#1074;&#1085;&#1091;&#1102;</a></div></div></body></html>");
    return html;
}

static String aboutPage()
{
    String html = htmlBegin("&#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;");
    html += F("<h1>&#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;</h1>");
    html += F("<div class='about'>== &#1069;&#1090;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1095;&#1072;&#1089;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; FlyRF ==<br>");
    html += F("== &#1041;&#1072;&#1079;&#1086;&#1074;&#1099;&#1081; LAN &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; ==<br>");
    html += F("&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1072; &#1089; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084;<br>");
    html += F("&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1083;&#1083;&#1077;&#1082;&#1090;&#1072;<br><br>");
    html += F("URL: https://www.decima.ru/contacts/<br>");
    html += F("E-mail: decima@decima.ru</div><div class='hr'></div>");
    html += F("<div class='about' style='text-align:center'>Copyright (C) 2023-2026&nbsp;&nbsp;&nbsp; &#1054;&#1054;&#1054; &#1044;&#1077;&#1094;&#1080;&#1084;&#1072;</div>");
    html += F("</div></body></html>");
    return html;
}

