MoseychukA/FLARM_ALL/Base_Lan_ESP32/ChatGPT_FlyRF_LanNew/FlyRf_LanUdp_26_03_31_08/WebRF.cpp
    String json = F("{\"ok\":true,\"reset_defaults\":");
    json += resetDefaults ? F("true") : F("false");
    json += F("}");
    sendNoCache();
    server.send(200, "application/json; charset=utf-8", json);
}

static void handleOutputsLive()
{
    if (!settings)
    {
        sendNoCache();
        server.send(500, "application/json; charset=utf-8", "{\"ok\":false,\"message\":\"settings not ready\"}");
        return;
    }

    if (server.hasArg("serial_out")) settings->serial_out = (uint8_t)clampInt(server.arg("serial_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_FLARM);
    if (server.hasArg("rs485_out")) settings->rs485_out = (uint8_t)clampInt(server.arg("rs485_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_FLARM);
    uint8_t lanMode = 0;
    if (server.hasArg("udp_on") && server.arg("udp_on").toInt() == 1) lanMode |= NMEA_OUT_UDP;
    settings->nmea_out = lanMode;
    EEPROM_store();

    sendNoCache();
    server.send(200, "application/json; charset=utf-8", "{\"ok\":true}");
}

static void handleHardwareInput()
{
    bool defaultsLoaded = false;
    if (settings)
    {
        if (server.hasArg("default_settings") && server.arg("default_settings").toInt() == 1)
        {
            EEPROM_clear();
            defaultsLoaded = true;
        }
        else
        {
            if (server.hasArg("rssi_view")) settings->rssi_view = (uint8_t)clampInt(server.arg("rssi_view").toInt(), 0, 1);
            if (server.hasArg("display_set")) settings->display_set = (uint8_t)clampInt(server.arg("display_set").toInt(), INFO_DISTLAY_OFF, INFO_DISPLAY_MAXI);
            if (server.hasArg("serial_out")) settings->serial_out = (uint8_t)clampInt(server.arg("serial_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_FLARM);
            if (server.hasArg("rs485_out")) settings->rs485_out = (uint8_t)clampInt(server.arg("rs485_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_FLARM);
            if (server.hasArg("lan_state_view")) settings->lan_state_view = (uint8_t)clampInt(server.arg("lan_state_view").toInt(), 0, 1);
            if (server.hasArg("view_test_coord")) settings->view_test_coord = (uint8_t)clampInt(server.arg("view_test_coord").toInt(), 0, 1);
            if (server.hasArg("block_addr")) settings->block_addr = (uint32_t)strtoul(server.arg("block_addr").c_str(), nullptr, 16);
            if (server.hasArg("threshold_level")) settings->threshold_level = (int16_t)clampInt(server.arg("threshold_level").toInt(), 0, 4095);
            EEPROM_store();
        }
        RP2040Bridge_sendGainNow();
    }
    sendPage(hardwareSavedPage(defaultsLoaded));
}

static void handleOutputsSave()
{
    if (settings)
    {
        if (server.hasArg("serial_out")) settings->serial_out = (uint8_t)clampInt(server.arg("serial_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_FLARM);
        if (server.hasArg("rs485_out")) settings->rs485_out = (uint8_t)clampInt(server.arg("rs485_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_FLARM);
        uint8_t lanMode = 0;
        if (server.hasArg("udp_on") && server.arg("udp_on").toInt() == 1) lanMode |= NMEA_OUT_UDP;
            settings->nmea_out = lanMode;
        EEPROM_store();
    }
    sendPage(outputsSavedPage());
}

static void handlePacketCounters()
{
    uint32_t txPackets = 0;
    uint32_t rxPackets = 0;
    RF_GetPacketCounters(txPackets, rxPackets);

    uint32_t lanTxPackets = 0;
    uint32_t lanRxPackets = 0;
    uint32_t lanUdpTxPackets = 0;
    uint32_t lanUdpRxPackets = 0;
    uint32_t lanTcpTxPackets = 0;
    uint32_t lanTcpRxPackets = 0;
    LAN_getPacketCounters(lanTxPackets, lanRxPackets, lanUdpTxPackets, lanUdpRxPackets, lanTcpTxPackets, lanTcpRxPackets);

    String json = F("{\"tx\":");
    json += String(txPackets);
    json += F(",\"rx\":");
    json += String(rxPackets);
    json += F(",\"lan_tx\":");
    json += String(lanTxPackets);
    json += F(",\"lan_rx\":");
    json += String(lanRxPackets);
    json += F(",\"lan_udp_tx\":");
    json += String(lanUdpTxPackets);
    json += F(",\"lan_udp_rx\":");
    json += String(lanUdpRxPackets);
    json += F(",\"lan_tcp_tx\":");
    json += String(lanTcpTxPackets);
    json += F(",\"lan_tcp_rx\":");
    json += String(lanTcpRxPackets);
    json += F(",\"mac\":\"");
    json += LAN_macAddressStr();
    json += F("\",\"tcp_addr\":\"");
    json += LAN_tcpAddressStr();
    json += F("\",\"lan_link_text\":\"");
    json += LAN_linkStatusStr();
    json += F("\",\"lan_dhcp\":");
    json += LAN_dhcpLeaseActive() ? F("true") : F("false");
    json += F("}");
    sendNoCache();
    server.send(200, "application/json; charset=utf-8", json);
}

static void handleOtaStatus()
{
    String json = F("{\"in_progress\":");
    json += g_otaInProgress ? F("true") : F("false");
    json += F(",\"written\":");
    json += String(g_otaWritten);
    json += F(",\"total\":");
    json += String(g_otaTotal);
    json += F(",\"ok\":");
    json += g_updateOk ? F("true") : F("false");
    json += F(",\"message\":\"");
    String msg = g_updateMessage;
    msg.replace("\\", "\\\\");
    msg.replace("\"", "\\\"");
    msg.replace("\r", " ");
    msg.replace("\n", " ");
    json += msg;
    json += F("\"}");
    sendNoCache();
    server.send(200, "application/json; charset=utf-8", json);
}

static void handleUpdateFinished()
{
    sendNoCache();
    server.send(200, "text/plain; charset=utf-8", (Update.hasError() || !g_updateOk) ? "FAIL" : "OK");
    if (!Update.hasError() && g_updateOk)
    {
        scheduleReboot(4000);
    }
}

static void handleUpdateUpload()
{
    HTTPUpload& upload = server.upload();

    if (upload.status == UPLOAD_FILE_START)
    {
        Serial.printf("[OTA] START filename=%s\n", upload.filename.c_str());
        g_updateOk = false;
        g_updateMessage = F("&#1048;&#1076;&#1105;&#1090; &#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;...");
        g_otaInProgress = true;
        g_otaWritten = 0;
        g_otaTotal = upload.totalSize;

        uint32_t maxSketchSpace = ((ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000);
        if (!Update.begin(maxSketchSpace))
        {
            g_updateMessage = F("&#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;");
            Update.printError(Serial);
        }
    }
    else if (upload.status == UPLOAD_FILE_WRITE)
    {
        if (Update.write(upload.buf, upload.currentSize) != upload.currentSize)
        {
            g_updateMessage = F("&#1054;&#1096;&#1080;&#1073;&#1082;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1087;&#1088;&#1086;&#1096;&#1080;&#1074;&#1082;&#1080;");
            g_updateOk = false;
            g_otaInProgress = false;
            Update.printError(Serial);
        }
        else
        {
            g_otaWritten += upload.currentSize;
            g_updateMessage = F("&#1055;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1072; &#1092;&#1072;&#1081;&#1083;&#1072; &#1085;&#1072; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;...");
            if ((g_otaWritten % 65536U) < (uint32_t)upload.currentSize)
                Serial.printf("[OTA] WRITTEN=%u/%u\n", (unsigned)g_otaWritten, (unsigned)g_otaTotal);
        }
    }
    else if (upload.status == UPLOAD_FILE_END)
    {
        g_otaInProgress = false;
        Serial.printf("[OTA] END written=%u total=%u\n", (unsigned)g_otaWritten, (unsigned)g_otaTotal);
        if (Update.end(true))
        {
            g_updateOk = true;
            g_otaWritten = g_otaTotal;
            g_updateMessage = F("&#1054;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1086;. &#1055;&#1077;&#1088;&#1077;&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072;...");
            Serial.printf("[OTA] SUCCESS size=%u\n", (unsigned)upload.totalSize);
        }
        else
        {
            g_updateOk = false;
            g_updateMessage = F("&#1054;&#1096;&#1080;&#1073;&#1082;&#1072; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;");
            Update.printError(Serial);
        }
    }
    else if (upload.status == UPLOAD_FILE_ABORTED)
    {
        g_otaInProgress = false;
        g_updateOk = false;
        g_updateMessage = F("&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1086;&#1090;&#1084;&#1077;&#1085;&#1077;&#1085;&#1072;");
        Serial.println("[OTA] ABORT");
        Update.abort();
    }
    yield();
}

static void handleNotFound()
{
    server.send(404, "text/plain; charset=utf-8", "File Not Found");
}

void Web_setup()
{
    server.on("/", handleRoot);
    server.on("/settings", handleSettings);
    server.on("/input", handleInput);
    server.on("/hardware_settings", handleHardwareSettings);
    server.on("/hardware_input", handleHardwareInput);
    server.on("/outputs", handleOutputs);
    server.on("/outputs_save", handleOutputsSave);
    server.on("/monitor", handleMonitor);
    server.on("/aircraft.json", handleAircraftJson);
    server.on("/packet_counters", handlePacketCounters);
    server.on("/about", handleAbout);
    server.on("/firmware", handleFirmware);
    server.on("/update", HTTP_POST, handleUpdateFinished, handleUpdateUpload);
    server.on("/ota_status", handleOtaStatus);
    server.onNotFound(handleNotFound);
    server.begin();
}

void Web_loop()
{
    server.handleClient();
    if (g_rebootPending && (int32_t)(millis() - g_rebootAtMs) >= 0)
    {
        g_rebootPending = false;
        ESP.restart();
    }
}

void Web_fini()
{
    server.stop();
}